{
  "Liêm Trinh": {
    "base": "là gì, cần update nè",
    "hoa": {
      "Hóa Lộc": "",
      "Hóa Kỵ": "Tình cảm trắc trở"
    }
  },
  "Phá Quân": {
    "base": "Phá ra, là sự đổi, là DO, làm việc, cứ hóa lộc hóa quyền là có sự thay đổi rồi",
    "hoa": {
      "Hóa Lộc": "",
      "Hóa Quyền": ""
    }
  },
  "Vũ Khúc": {
    "base": "Chủ về tiền bạc, về kim loại, về nghề nghiệp liên quan đến kim loại. Về sự chủ động, là sự quản lý tài chính",
    "hoa": {
      "Hóa Lộc": "update",
      "Hóa Quyền": "thêm phần hành động, sự quyết liệt",
      "Hóa Khoa": "chỉ có tiếng không có miếng",
      "Hóa Kỵ": "tài tinh sợ nhất hóa kỵ, có thể là chi tiêu mở rộng, dính lứu dao kéo, kiểm tra KHÔNG-KIẾP. ĐỐI XUONG KHÚC không có thì nguy hơn"
    }
  },
  "Thái Dương": {
    "base": "Là con giai, là đi chơi, là buôn điện thoại, là danh tiếng",
    "hoa": {
      "Hóa Lộc": "là vui bên ngoài",
      "Hóa Quyền": "là tăng địa vị, quyền lực",
      "Hóa Kỵ": "buồn rồi, ngược lại tính cách Thái Dương"
    }
  },
  "Thiên Cơ": {
    "base": "Là cái đầu, là suy nghĩ, trí tuệ mưu lược, sự chủ động linh hoạt",
    "hoa": {
      "Hóa Lộc": "SỰ CHỦ ĐỘNG",
      "Hóa Quyền": "SỰ LINH HOẠT",
      "Hóa Khoa": "xu hướng theo QUYỀN, VIRAL",
      "Hóa Kỵ": "Giảm linh động, là suy nghĩ nhiều tiêu cực, có trở ngại, hoặc phản ứng quá mức"
    }
  },
  "Thiên Lương": {
    "base": "",
    "hoa": {
      "Hóa Lộc": "",
      "Hóa Quyền": "",
      "Hóa Khoa": ""
    }
  },
  "Tử Vi": {
    "base": "",
    "hoa": {
      "Hóa Quyền": "",
      "Hóa Khoa": ""
    }
  },
  "Thái Âm": {
    "base": "TIỀN TÀI, tích trữ, kế hoạch (nhưng không có tính hành động)",
    "hoa": {
      "Hóa Lộc": "có tiền rồi, nhưng phải miếu vượng, hoặc không thì gặp phản cách phù hợp. Nếu hãm thì niềm vui tinh thần thôi, kiểu mãn nguyện",
      "Hóa Quyền": "mang tính cát lợi nha, mang tính kiểm soát đc nguồn tài chính",
      "Hóa Khoa": "Biểu trưng cho tu dưỡng",
      "Hóa Kỵ": "Bất lợi với người thân phái nữ, nhất là hãm. Mất tiền hoặc rắc rối tình cảm"
    }
  },
  "Thiên Đồng": {
    "base": "chủ tâm trạng, là inner child",
    "hoa": {
      "Hóa Lộc": "tăng tài lộc, dễ gặp duyên bất ngờ",
      "Hóa Quyền": "có năng lực khai sáng, nhưng dễ chìm đắm lục dục, thiếu chí tiến thủ. Kiểu tiềm năng của đứa trẻ nhưng pạn chưa đủ năng lực",
      "Hóa Kỵ": "Tâm trạng bất ổn. Dễ xảy ra rắc rối, khó xử về tình cảm, khổ vì tình. Tâm Trạng bất an, tinh thần suy sụp"
    }
  },
  "Văn Xương": {
    "base": "",
    "hoa": {
      "Hóa Khoa": "",
      "Hóa Kỵ": ""
    }
  },
  "Cự Môn": {
    "base": "là cái miệng, thì phi, điều tiếng",
    "hoa": {
      "Hóa Lộc": "Hóa lộc thành nói để phục vụ, ngọt ngào. Khuynh hướng show off bản thân mạnh, dễ che lấp người khác gây thị phi. Cự môn lộc kị sát tinh đồng cung, nhất HỎA LINH",
      "Hóa Quyền": "Lời nói có sức thuyết phục",
      "Hóa Kỵ": "cự kị còn là hay hỏi, hay thắc mắc, phản biện, bộ sao của Mình, Trường, QAN là bộ dễ cự kị nên hay đi hỏi là đây. Dễ vướng thị phi, tranh cãi"
    }
  },
  "Tham Lang": {
    "base": "Ham Muốn: vật chất, hưởng thụ, giao tế, làm đẹp, xinh . Dễ chi tiêu mạnh. Trang sức, trang hoàng, làm dáng",
    "hoa": {
      "Hóa Lộc": "",
      "Hóa Quyền": "quyền làm tăng dục vọng, tính cạnh tranh cao",
      "Hóa Kỵ": "ĐOẠT TÌNH, nhẹ thì ko theo ý, nặng thì stress. hóa kị mất phép lịch sự, thiếu đức, tốn tiền vô ích"
    }
  },
  "Hữu Bật": {
    "base": "",
    "hoa": {
      "Hóa Khoa": ""
    }
  },
  "Văn Khúc": {
    "base": "",
    "hoa": {
      "Hóa Khoa": "",
      "Hóa Kỵ": ""
    }
  },
  "Thiên Phủ": {
    "base": "",
    "hoa": {
      "Hóa Khoa": ""
    }
  }
}